//Написать рекурсивную функцию нахождения
//наибольшего общего делителя двух целых чисел.
#include "pch.h"
//#include<stdlib.h>
//#include<iostream>
//#include<windows.h>
//#include<time.h>
//using namespace std;
//
//int NOD(int ch1, int ch2) {
//	if (ch2 == 0) {
//		return ch1;
//	}
//	else {
//		return NOD(ch2, ch1 % ch2);
//	}
//}
//
//int main() {
//	cout << NOD(0, 5);
//}